{"segmentation":[{"idx":0,"txt":"In the United States, a surprising observation is that young kids assign no more than six minutes a day to reading.","obg":"a"},{"idx":1,"txt":"This phenomenon begins at a crucial stage in youth when children are in a transition between picture books and alphabet books, being an abrupt change in children's reading habits.","obg":"a"},{"idx":2,"txt":"These findings are two among many pointed out by experts like Daniel Willingham, a professor at the University of Virginia, who has devoted substantial research into understanding the dynamics of reading habits (Willingham, 2015).","obg":"a"},{"idx":3,"txt":"This decline in reading, especially among the youth, is not isolated but mirrors global trends.","obg":"a"},{"idx":4,"txt":"According to Twenge & Campbell (2018), the seductive allure of screen time, coupled with an overwhelming influx of multimedia content, contributes significantly to this decline and is increasingly becoming more prevalent in our society","obg":"a"},{"idx":5,"txt":"As adolescents mature, the deterioration in their reading habits becomes even more pronounced.","obg":"a"},{"idx":6,"txt":"Factors include diminishing motivation, echoed by McKenna et al. (2012), who found that reading attitudes notably change during the middle school years, is increasingly getting worse in the 21st century.","obg":"a"},{"idx":7,"txt":"External distractions, intensified by the omnipresence of mobile phones and other technologies (Kuznekoff & Titsworth, 2013), further exacerbate this issue.","obg":"a"},{"idx":8,"txt":"Moreover, there's a palpable lack of engagement with traditional reading methods.","obg":"a"},{"idx":9,"txt":"Baron (2015) notes that the digital age, with its quick, bite-sized information, challenges the conventional long-form reading styles.","obg":"a"},{"idx":10,"txt":"To combat this, it's imperative to innovate and find newer methods that resonate with today's youth.","obg":"b"},{"idx":11,"txt":"Technologies like Augmented Reality (AR) and Virtual Reality (VR) have begun to show immense potential in education and reading habits (Johnson et al., 2011).","obg":"c"},{"idx":12,"txt":"These immersive technologies could provide a multisensory, gamified reading experience.","obg":"c"},{"idx":13,"txt":"By infusing reading with interactive elements similar to video games (Gee, 2003), educators and content creators have the potential to reignite the declining interest.","obg":"c"},{"idx":14,"txt":"Yet, it's crucial to approach this integration thoughtfully.","obg":"x","rmk":["While this sentence is an effective transitional statement, it does not directly address any specific obligations. Find a way to transition to the next paragraph while also addressing an obligation."]},{"idx":15,"txt":"As Gottfried & Schmitt (2014) point out, while multisensory experiences are enriching, there's a need for a balanced and well-curated union to ensure that one sensory input doesn't overshadow the reading experience.","obg":"d"},{"idx":16,"txt":"The ultimate vision of this project is not just about replacing reading as a regular activity but also to transform it into an entertaining and immersive experience for the children that are in the transition from visual books to more complex readings.","obg":"e"},{"idx":17,"txt":"The paradigm is shifting from mere uni-sensory reading experiences to those that offer interactive, multisensory journeys (Dede, 2009).","obg":"a"},{"idx":18,"txt":"Such transitions, when handled smoothly, can renew a love for books and reading among the younger generation, challenging the traditional notions and expanding horizons.","obg":"e"},{"idx":19,"txt":"We are living in an era where the future of reading could be shaped in new ways, introducing new technologies such as AR/VR or even changing the paradigm of writing by shared authority with generative AI, re-understanding how stories are consumed and written.","obg":"f"}],"obligations_structural_analysis":{"a":{"rationale":"This obligation is addressed with an extensive and detailed diagnosis of the context, occupying a significant portion of the text.","evaluation":2},"b":{"rationale":"The problem statement is present but could be more explicitly defined with clearer critical response to the diagnosed issue.","evaluation":0},"c":{"rationale":"The methods section is detailed, specifying innovative approaches with immersive technologies, aligning with expectations.","evaluation":2},"d":{"rationale":"The text does not explicitly address the limitations of the project, which is a requirement.","evaluation":0},"e":{"rationale":"The significance of the project is present, but mixed with other obligations.","evaluation":0},"f":{"rationale":"Future work is suggested, but would improve with a more clear statement of applications and impacts of the project.","evaluation":2}},"overall_structural_analysis":{"rationale":"The text broadly addresses all six obligations but lacks a clear delineation of limitations (Obligation D). The problem statement (Obligation B) could be more distinctly articulated to enhance clarity. Methods, significance, and future work are covered but should be clarified. The absence of a limitations section weakens the overall structure.","recommendation":"To improve the structure of this text,the authors should focus on developing a clear problem statement, which is the most important obligation of an abstract. Further, incorporating a clear statement on limitations and refining the problem statement could improve the structure.","evaluation":1}}