{"segmentation":[{"idx":0,"txt":"After billions of years of evolution, nature, as it exists on earth, is self-sufficient.","obgs":["a","x"],"rmk":["This sentence sets a context which is very broad, and may not contribute to diagnosing the context of the project."]},{"idx":1,"txt":"Systems such as weather patterns and food chains operate on large scales over vast periods of time, without the need for additional input.","obgs":["a","x"],"rmk":["Like the previous one, this sentence defines a very broad domain, but is getting closer and does contribute to diagnosing the context of the project."]},{"idx":2,"txt":"However, confined to the sterile home of a human being, this natural world is no longer self-sufficient.","obgs":["a"]},{"idx":3,"txt":"Early on in human development, the advancement of technologies such as agriculture and architecture intentionally excluded this natural world from the home.","obgs":["a"]},{"idx":4,"txt":"As we introduced the natural world back into our homes in the form of house plants, we stripped these creatures of their previous autonomy and confined them to stagnant pots, in return gaining just a visually appealing object.","obgs":["a"]},{"idx":5,"txt":"It is my view that this is a shallow relationship.","obgs":["b"]},{"idx":6,"txt":"I propose that the future of human-nature interaction in the home relies on two important factors.","obgs":["b"]},{"idx":7,"txt":"One, the plant must gain physical autonomy to seek out what it needs most, liberating the plant from its tiny pot, and the human being must in turn benefit from this plant being in their home.","obgs":["b"]},{"idx":8,"txt":"There have been numerous projects in the past that have attempted to design for one of these proposals, yet never both.","obgs":["a"]},{"idx":9,"txt":"With recent technological advances in the fields of biology, sensing technologies, and computing, it is now possible to deepen this relationship between humans and plants.","obgs":["b","c"]},{"idx":10,"txt":"I propose the creation of a plant system called Microcosm that uses these advances to break the plant free from their dependency on the human in the form of a autonomous, movable, robotic planter, which will be specifically designed for one plant: Sphagnum moss.","obgs":["c"]},{"idx":11,"txt":"In return for being given optimal conditions to thrive, the moss will purify the air of the indoor environment.","obgs":["c"]},{"idx":12,"txt":"Additionally, giving the plant the ability to move allows for optimal light and moisture tracking which keeps the moss healthy, while simultaneously purifying the air in multiple rooms of a home.","obgs":["c"]},{"idx":13,"txt":"Furthermore, using moss as the primary air filter allows this to be a zero waste system, unlike traditional HEPA filters.","obgs":["e"]},{"idx":14,"txt":"This project is significant because it is the first in-home autonomous system designed to keep moss healthy with no human input, while also representing a breakthrough in zero waste air cleaning capabilities.","obgs":["e"]},{"idx":15,"txt":"In the future, we would like to design this system for other types of human plant interactions, however for the purposes of this project air purification will be the focus.","obgs":["f"]}],"obligations_structural_analysis":{"a":{"evaluation":"meets expectations","rationale":"This obligation is addressed with the appropriate amount of text and in the correct order, but also includes extraneous statements that may be too broadly scoped for the project."},"b":{"evaluation":"needs improvement","rationale":"The problem statement is somewhat dispersed and could be more concise."},"c":{"evaluation":"is well-formed","rationale":"This obligation is thoroughly addressed with a detailed explanation of the methods."},"d":{"evaluation":"is ill-formed","rationale":"There is no explicit mention of the project's limits, which does not meet the expectations for this obligation."},"e":{"evaluation":"meets expectations","rationale":"The significance of the project is appropriately highlighted, aligning with expectations."},"f":{"evaluation":"meets expectations","rationale":"Future work is described, indicating a clear direction for subsequent research."}},"overall_structural_analysis":{"evaluation":"needs improvement","rationale":"While the text addresses most obligations, it lacks a clear delineation of the project's limits (Obligation D). The problem statement (Obligation B) is not as concise as it should be, leading to some confusion. Methods are well-explained, and the significance and future work are adequately addressed, but the absence of clearly defined limits detracts from the overall structure. Clarification and addition of the limitations could significantly improve the structure."}}